In [21]:
import pandas as pd
import numpy as nm

In [53]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
'Math Score': [85, 92, 78, 88],
'English Score': [90, 86, 92, 80]}

df = pd.DataFrame(data)

In [40]:
print(df)

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          92             86
2  Charlie          78             92
3    David          88             80

Question
1.Retrieve the English score of 'Charlie'.
2.Get the Math scores of all students.
3.Access the English score of the first student.
4. Retrieve the Math score of the last student.
5.Update Bob's Math score to 95.
6.Increase Charlie's English score by 5 points.
7.Add a new row for 'Eve' with Math Score 88 and English Score 95.
8.Delete the row for 'David' from the DataFrame.
9.Insert a new column called 'Science Score' with values [92, 84, 89, 78].
10.Delete the 'English Score' column from the DataFrame.
11.Create a new column 'Total Score' that represents the sum of Math Score and English Score for each student.
12.Find the student with the highest Total Score.

In [41]:
#1.Retrieve the English score of 'Charlie'.
df.loc[[2],['English Score']]

   English Score
2             92

In [27]:
df.loc[[2],['Name','English Score']]

      Name  English Score
2  Charlie             92

In [4]:
#2. Get the Math scores of all students
df['Math Score']

0    85
1    92
2    78
3    88
Name: Math Score, dtype: int64

In [17]:
#3.Access the English score of the first student.
df.loc[0]['Math Score']
#here 0 is first student

85

In [29]:
#4. Retrieve the Math score of the last student.
df.loc[3]['Math Score']

88

In [42]:
#5.Update Bob's Math score to 95.
df.loc[1,'Math Score']=[95]
df

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          95             86
2  Charlie          78             92
3    David          88             80

In [43]:
#6.Increase Charlie's English score by 5 points.
df.loc[1,'English Score']+=5
df

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          95             91
2  Charlie          78             92
3    David          88             80

In [45]:
#7.Add a new row for 'Eve' with Math Score 88 and English Score 95.
df.loc[4]=['Eve','88','95']
df

      Name Math Score English Score
0    Alice         85            90
1      Bob         95            91
2  Charlie         78            92
3    David         88            80
4      Eve         88            95

In [46]:
#8.Delete the row for 'David' from the DataFrame.
df.drop(labels=[3],inplace=True)
df

      Name Math Score English Score
0    Alice         85            90
1      Bob         95            91
2  Charlie         78            92
4      Eve         88            95

In [57]:
#9.Insert a new column called 'Science Score' with values [92, 84, 89, 78].
df['Science Score'] = [92, 84, 89, 78]
df

      Name  Math Score  Science Score
0    Alice          85             92
1      Bob          92             84
2  Charlie          78             89
3    David          88             78

In [54]:
#10.Delete the 'English Score' column from the DataFrame.
df=df.drop(labels=['English Score'],axis=1,inplace=False)
df

      Name  Math Score
0    Alice          85
1      Bob          92
2  Charlie          78
3    David          88

In [59]:
#11.Create a new column 'Total Score' that represents the sum of Math Score and English Score for each student
df['Total Score'] = df['Math Score'] + df['Science Score']
df

      Name  Math Score  Science Score  Total Score
0    Alice          85             92          177
1      Bob          92             84          176
2  Charlie          78             89          167
3    David          88             78          166

In [60]:
#12.Find the student with the highest Total Score
df.loc[df['Total Score'].idxmax(), 'Name']

'Alice'

Combine this DataFrame (df2) with the original DataFrame (df) to create a new DataFrame that includes all students.

In [62]:
data2 = {'Name': ['Eve', 'Frank'],
'Math Score': [87, 76],
'English Score': [94, 82]}
df2 = pd.DataFrame(data2)
df2

    Name  Math Score  English Score
0    Eve          87             94
1  Frank          76             82

In [63]:
combined_df = pd.concat([df, df2], ignore_index=True)

print(combined_df)

      Name  Math Score  Science Score  Total Score  English Score
0    Alice          85           92.0        177.0            NaN
1      Bob          92           84.0        176.0            NaN
2  Charlie          78           89.0        167.0            NaN
3    David          88           78.0        166.0            NaN
4      Eve          87            NaN          NaN           94.0
5    Frank          76            NaN          NaN           82.0